Revit 2027 API
ParameterTypeId.WallSweepProfileParam Property
 "Profile"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId WallSweepProfileParam { get; }
Public Shared ReadOnly Property WallSweepProfileParam As ForgeTypeId
	Get
public:
static property ForgeTypeId^ WallSweepProfileParam {
	ForgeTypeId^ get ();
}
static member WallSweepProfileParam : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace